; domain
(define (domain gripper-strips)

    (:predicates (room ?r)
                (ball ?b)
                (gripper ?g)
                (at-robby ?r)
                (at ?b ?r)
                (free ?g)
                (carry ?o ?g)
    )

    (:action move
        :parameters (?from ?to)
        :precondition (and (room ?from)(room ?to)(at-robby ?from))
        :effect (and
            (at-robby ?to)
            (not (at-robby ?from))
        )
    )
    (:action pick
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(at ?obj ?room)(at-robby ?room)(free ?gripper))
        :effect (and
            (carry ?obj ?gripper)
            (not (at ?obj ?room))
            (not (free ?gripper))
        )
    )
    (:action drop
        :parameters (?obj ?room ?gripper)
        :precondition (and (ball ?obj)(room ?room)(gripper ?gripper)(carry ?obj ?gripper)(at-robby ?room))
        :effect (and
            (at ?obj ?room)
            (free ?gripper)
            (not (carry ?obj ?gripper))
        )
    )
)

; problem
(define (problem gripper-26)
(:domain gripper-strips)
(:objects rooma roomb room3 room4 room5 room6 left ball1 ball2 ball3 ball4 ball5 ball6 ball7 ball8 ball9 ball10 ball11 ball12 ball13 ball14 ball15 ball16 ball17 ball18 ball19 ball20 ball21 ball22 ball23 ball24 ball25 ball26 )
(:init
(room rooma)
(room roomb)
(room room3)
(room room4)
(room room5)
(room room6)
(gripper left)
(ball ball1)
(ball ball2)
(ball ball3)
(ball ball4)
(ball ball5)
(ball ball6)
(ball ball7)
(ball ball8)
(ball ball9)
(ball ball10)
(ball ball11)
(ball ball12)
(ball ball13)
(ball ball14)
(ball ball15)
(ball ball16)
(ball ball17)
(ball ball18)
(ball ball19)
(ball ball20)
(ball ball21)
(ball ball22)
(ball ball23)
(ball ball24)
(ball ball25)
(ball ball26)
(free left)
(at ball1 rooma)
(at ball2 rooma)
(at ball3 roomb)
(at ball4 roomb)
(at ball5 roomb)
(at ball6 roomb)
(at ball7 roomb)
(at ball8 roomb)
(at ball9 roomb)
(at ball10 room3)
(at ball11 room3)
(at ball12 room4)
(at ball13 room4)
(at ball14 room4)
(at ball15 room4)
(at ball16 room5)
(at ball17 room5)
(at ball18 room5)
(at ball19 room5)
(at ball20 room5)
(at ball21 room5)
(at ball22 room5)
(at ball23 room6)
(at ball24 room6)
(at ball25 room6)
(at ball26 room6)
(at-robby rooma)
)
(:goal
(and
(at ball1 rooma)
(at ball2 rooma)
(at ball3 rooma)
(at ball4 rooma)
(at ball5 rooma)
(at ball6 rooma)
(at ball7 rooma)
(at ball8 rooma)
(at ball9 roomb)
(at ball10 roomb)
(at ball11 roomb)
(at ball12 roomb)
(at ball13 roomb)
(at ball14 room3)
(at ball15 room3)
(at ball16 room3)
(at ball17 room4)
(at ball18 room5)
(at ball19 room5)
(at ball20 room5)
(at ball21 room6)
(at ball22 room6)
(at ball23 room6)
(at ball24 room6)
(at ball25 room6)
(at ball26 room6)
)
)
)

; plan
1. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 10 of 26
2. (pick ball8 roomb left)
   deleted: (at ball8 roomb) (free left)
   added: (carry ball8 left)
   goals met: 10 of 26
3. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 10 of 26
4. (drop ball8 rooma left)
   deleted: (carry ball8 left)
   added: (at ball8 rooma) (free left)
   goals met: 11 of 26
5. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 11 of 26
6. (pick ball7 roomb left)
   deleted: (at ball7 roomb) (free left)
   added: (carry ball7 left)
   goals met: 11 of 26
7. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 11 of 26
8. (drop ball7 rooma left)
   deleted: (carry ball7 left)
   added: (at ball7 rooma) (free left)
   goals met: 12 of 26
9. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 12 of 26
10. (pick ball6 roomb left)
   deleted: (at ball6 roomb) (free left)
   added: (carry ball6 left)
   goals met: 12 of 26
11. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 12 of 26
12. (drop ball6 rooma left)
   deleted: (carry ball6 left)
   added: (at ball6 rooma) (free left)
   goals met: 13 of 26
13. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 13 of 26
14. (pick ball5 roomb left)
   deleted: (at ball5 roomb) (free left)
   added: (carry ball5 left)
   goals met: 13 of 26
15. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 13 of 26
16. (drop ball5 rooma left)
   deleted: (carry ball5 left)
   added: (at ball5 rooma) (free left)
   goals met: 14 of 26
17. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 14 of 26
18. (pick ball4 roomb left)
   deleted: (at ball4 roomb) (free left)
   added: (carry ball4 left)
   goals met: 14 of 26
19. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 14 of 26
20. (drop ball4 rooma left)
   deleted: (carry ball4 left)
   added: (at ball4 rooma) (free left)
   goals met: 15 of 26
21. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 15 of 26
22. (pick ball3 roomb left)
   deleted: (at ball3 roomb) (free left)
   added: (carry ball3 left)
   goals met: 15 of 26
23. (move roomb rooma)
   deleted: (at-robby roomb)
   added: (at-robby rooma)
   goals met: 15 of 26
24. (drop ball3 rooma left)
   deleted: (carry ball3 left)
   added: (at ball3 rooma) (free left)
   goals met: 16 of 26
25. (move rooma roomb)
   deleted: (at-robby rooma)
   added: (at-robby roomb)
   goals met: 16 of 26
26. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 16 of 26
27. (pick ball22 room5 left)
   deleted: (at ball22 room5) (free left)
   added: (carry ball22 left)
   goals met: 16 of 26
28. (move room5 room6)
   deleted: (at-robby room5)
   added: (at-robby room6)
   goals met: 16 of 26
29. (drop ball22 room6 left)
   deleted: (carry ball22 left)
   added: (at ball22 room6) (free left)
   goals met: 17 of 26
30. (move room6 room5)
   deleted: (at-robby room6)
   added: (at-robby room5)
   goals met: 17 of 26
31. (pick ball21 room5 left)
   deleted: (at ball21 room5) (free left)
   added: (carry ball21 left)
   goals met: 17 of 26
32. (move room5 room6)
   deleted: (at-robby room5)
   added: (at-robby room6)
   goals met: 17 of 26
33. (drop ball21 room6 left)
   deleted: (carry ball21 left)
   added: (at ball21 room6) (free left)
   goals met: 18 of 26
34. (move room6 roomb)
   deleted: (at-robby room6)
   added: (at-robby roomb)
   goals met: 18 of 26
35. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 18 of 26
36. (pick ball17 room5 left)
   deleted: (at ball17 room5) (free left)
   added: (carry ball17 left)
   goals met: 18 of 26
37. (move room5 room4)
   deleted: (at-robby room5)
   added: (at-robby room4)
   goals met: 18 of 26
38. (drop ball17 room4 left)
   deleted: (carry ball17 left)
   added: (at ball17 room4) (free left)
   goals met: 19 of 26
39. (pick ball15 room4 left)
   deleted: (at ball15 room4) (free left)
   added: (carry ball15 left)
   goals met: 19 of 26
40. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 19 of 26
41. (drop ball15 room3 left)
   deleted: (carry ball15 left)
   added: (at ball15 room3) (free left)
   goals met: 20 of 26
42. (pick ball11 room3 left)
   deleted: (at ball11 room3) (free left)
   added: (carry ball11 left)
   goals met: 20 of 26
43. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 20 of 26
44. (drop ball11 roomb left)
   deleted: (carry ball11 left)
   added: (at ball11 roomb) (free left)
   goals met: 21 of 26
45. (move roomb room5)
   deleted: (at-robby roomb)
   added: (at-robby room5)
   goals met: 21 of 26
46. (pick ball16 room5 left)
   deleted: (at ball16 room5) (free left)
   added: (carry ball16 left)
   goals met: 21 of 26
47. (move room5 roomb)
   deleted: (at-robby room5)
   added: (at-robby roomb)
   goals met: 21 of 26
48. (move roomb room3)
   deleted: (at-robby roomb)
   added: (at-robby room3)
   goals met: 21 of 26
49. (drop ball16 room3 left)
   deleted: (carry ball16 left)
   added: (at ball16 room3) (free left)
   goals met: 22 of 26
50. (pick ball10 room3 left)
   deleted: (at ball10 room3) (free left)
   added: (carry ball10 left)
   goals met: 22 of 26
51. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 22 of 26
52. (drop ball10 roomb left)
   deleted: (carry ball10 left)
   added: (at ball10 roomb) (free left)
   goals met: 23 of 26
53. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 23 of 26
54. (pick ball14 room4 left)
   deleted: (at ball14 room4) (free left)
   added: (carry ball14 left)
   goals met: 23 of 26
55. (move room4 room3)
   deleted: (at-robby room4)
   added: (at-robby room3)
   goals met: 23 of 26
56. (drop ball14 room3 left)
   deleted: (carry ball14 left)
   added: (at ball14 room3) (free left)
   goals met: 24 of 26
57. (move room3 roomb)
   deleted: (at-robby room3)
   added: (at-robby roomb)
   goals met: 24 of 26
58. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 24 of 26
59. (pick ball13 room4 left)
   deleted: (at ball13 room4) (free left)
   added: (carry ball13 left)
   goals met: 24 of 26
60. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 24 of 26
61. (drop ball13 roomb left)
   deleted: (carry ball13 left)
   added: (at ball13 roomb) (free left)
   goals met: 25 of 26
62. (move roomb room4)
   deleted: (at-robby roomb)
   added: (at-robby room4)
   goals met: 25 of 26
63. (pick ball12 room4 left)
   deleted: (at ball12 room4) (free left)
   added: (carry ball12 left)
   goals met: 25 of 26
64. (move room4 roomb)
   deleted: (at-robby room4)
   added: (at-robby roomb)
   goals met: 25 of 26
65. (drop ball12 roomb left)
   deleted: (carry ball12 left)
   added: (at ball12 roomb) (free left)
   goals met: 26 of 26
